Revit 2024 API
Curve.Clone Method
Returns a copy of this curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public Curve Clone()
Visual Basic
Public Function Clone As Curve
Visual C++
public:
Curve^ Clone()
Return Value
A copy of this curve.
See Also
Curve Class
Autodesk.Revit.DB Namespace